package com.greener.codegreen.dao;

import org.springframework.dao.DataAccessException;

import com.greener.codegreen.dto.DashBoardDTO;

public interface DashBoardDAO {

	//-----------------------------------------------------------------------------//
	// 쌀,잡곡 판매량 가져오기                                                     //
	//-----------------------------------------------------------------------------//
	public DashBoardDTO getGrainVolume() throws DataAccessException;
	
	//-----------------------------------------------------------------------------//
	// 과일,견과,건과 판매량 가져오기                                              //
	//-----------------------------------------------------------------------------//
	public DashBoardDTO getFruitVolume() throws DataAccessException;
	
	//-----------------------------------------------------------------------------//
	// 수산, 건어물 판매량 가져오기                                                //
	//-----------------------------------------------------------------------------//
	public DashBoardDTO getFishVolume() throws DataAccessException;
	
	//-----------------------------------------------------------------------------//
	// 정육,계란류 판매량 가져오기                                                 //
	//-----------------------------------------------------------------------------//
	public DashBoardDTO getMeatVolume() throws DataAccessException;

	//-----------------------------------------------------------------------------//
	// 건강식품 판매량 가져오기                                                    //
	//-----------------------------------------------------------------------------//
	public DashBoardDTO getHealthyVolume() throws DataAccessException;

	//-----------------------------------------------------------------------------//
	// 차·음료·생수·유제품 판매량 가져오기                                         //
	//-----------------------------------------------------------------------------//
	public DashBoardDTO getWaterVolume() throws DataAccessException;
	
	//-----------------------------------------------------------------------------//
	// 과자·간식·빵·빙과 판매량 가져오기                                           //
	//-----------------------------------------------------------------------------//
	public DashBoardDTO getSnackVolume() throws DataAccessException;
}
