package com.greener.codegreen.dao;

import java.util.HashMap;
import java.util.List;

import org.springframework.dao.DataAccessException;

import com.greener.codegreen.common.SearchCriteria;
import com.greener.codegreen.dto.ProductOrderBuyerDTO;

public interface OrderDAO {
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 목록 불러오기 (전체 주문)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListAll(SearchCriteria scri) throws DataAccessException;

	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderList(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(onlyDay)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListOnlyDay(SearchCriteria scri) throws DataAccessException;

	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(onlyWeek)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListOnlyWeek(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(onlyMonth)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListOnlyMonth(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(orderListTwo)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListTwo(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(orderListDay)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListDay(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(orderListWeek)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListWeek(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(orderListMonth)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListMonth(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(orderListTwo)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListThree(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(orderListDay)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListDayTwo(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(orderListWeek)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListWeekTwo(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(orderListMonth)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListMonthTwo(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(orderListWhole)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListWhole(SearchCriteria scri) throws DataAccessException;
		
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 총 개수 구하기(orderTotalNumWhole)
	//-----------------------------------------------------------------------------------------------------------
	public int orderTotalNumWhole(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 총 개수 구하기(orderTotalNum)
	//-----------------------------------------------------------------------------------------------------------
	public int orderTotalNum(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 총 개수 구하기(orderTotalNumTwo)
	//-----------------------------------------------------------------------------------------------------------
	public int orderTotalNumTwo(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 총 개수 구하기(orderTotalNumOnlyDay)
	//-----------------------------------------------------------------------------------------------------------
	public int orderTotalNumOnlyDay(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 총 개수 구하기(orderTotalNumOnlyWeek)
	//-----------------------------------------------------------------------------------------------------------
	public int orderTotalNumOnlyWeek(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 총 개수 구하기(orderTotalNumOnlyMonth)
	//-----------------------------------------------------------------------------------------------------------
	public int orderTotalNumOnlyMonth(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 총 개수 구하기(orderTotalNumDay)
	//-----------------------------------------------------------------------------------------------------------
	public int orderTotalNumDay(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 총 개수 구하기(orderTotalNumWeek)
	//-----------------------------------------------------------------------------------------------------------
	public int orderTotalNumWeek(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 총 개수 구하기(orderTotalNumMonth)
	//-----------------------------------------------------------------------------------------------------------
	public int orderTotalNumMonth(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 총 개수 구하기(orderTotalNumThree)
	//-----------------------------------------------------------------------------------------------------------
	public int orderTotalNumThree(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 총 개수 구하기(orderTotalNumDayTwo)
	//-----------------------------------------------------------------------------------------------------------
	public int orderTotalNumDayTwo(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 총 개수 구하기(orderTotalNumWeekTwo)
	//-----------------------------------------------------------------------------------------------------------
	public int orderTotalNumWeekTwo(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 총 개수 구하기(orderTotalNumMonthTwo)
	//-----------------------------------------------------------------------------------------------------------
	public int orderTotalNumMonthTwo(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 총 개수 구하기(orderTotalNumFour)
	//-----------------------------------------------------------------------------------------------------------
	public int orderTotalNumFour(SearchCriteria scri) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 주문번호 누르면 상세 주문내역 보여주기
	//-----------------------------------------------------------------------------------------------------------
	public ProductOrderBuyerDTO orderDetail(int orderNum) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 취소하기
	//-----------------------------------------------------------------------------------------------------------
	public int orderListCancle(int oNum) throws DataAccessException;

}
