package com.greener.codegreen.dao;

import java.util.HashMap;
import java.util.List;

import org.springframework.dao.DataAccessException;

import com.greener.codegreen.dto.ProductOrderBuyerDTO;

public interface OrderDAO {
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 목록 불러오기 (전체&조건지정시)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListAll() throws Exception;

	//----------------------------------------------------------------------------------//
	// 조건에 맞는 주문내역 목록 불러오기
	//----------------------------------------------------------------------------------//
	public List<HashMap<String, String>> orderList(HashMap<String, String> paramMap) throws Exception;

	//-----------------------------------------------------------------------------------------------------------
	// 주문번호 누르면 상세 주문내역 보여주기
	//-----------------------------------------------------------------------------------------------------------
	public ProductOrderBuyerDTO orderDetail(int orderNum) throws Exception;
	
	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(day)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListDay(HashMap<String, String> paramMap) throws Exception;
		
	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(Onlyday)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListOnlyDay(HashMap<String, String> paramMap) throws Exception;
		
	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(week)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListWeek(HashMap<String, String> paramMap) throws Exception;
	
	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(Onlyweek)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListOnlyWeek(HashMap<String, String> paramMap) throws Exception;
	
	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(month)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListMonth(HashMap<String, String> paramMap) throws Exception;
		
	//-----------------------------------------------------------------------------------------------------------
	// 조건에 맞는 주문내역 목록 불러오기(Onlymonth)
	//-----------------------------------------------------------------------------------------------------------
	public List<HashMap<String, String>> orderListOnlyMonth(HashMap<String, String> paramMap) throws Exception;
		
	//-----------------------------------------------------------------------------------------------------------
	// 전체 주문 개수 불러오기
	//-----------------------------------------------------------------------------------------------------------
	public int orderCountAll() throws Exception;
	
	//-----------------------------------------------------------------------------------------------------------
	// 주문내역 취소하기
	//-----------------------------------------------------------------------------------------------------------
	public int orderListCancle(int oNum) throws Exception;
}
