package com.greener.codegreen.service;

import org.springframework.dao.DataAccessException;

import com.greener.codegreen.dto.DashBoardDTO;


public interface DashBoardService {
	
	
	//-----------------------------------------------------------------------------//
	// 쌀,잡곡 판매량 가져오기                                                     //
	//-----------------------------------------------------------------------------//
	public DashBoardDTO getGrain() throws DataAccessException;
	
	//-----------------------------------------------------------------------------//
	// 과일,견과,건과 판매량 가져오기                                              //
	//-----------------------------------------------------------------------------//
	public DashBoardDTO getFruit() throws DataAccessException;
	
	//-----------------------------------------------------------------------------//
	// 수산, 건어물 판매량 가져오기                                                //
	//-----------------------------------------------------------------------------//
	public DashBoardDTO getFish() throws DataAccessException;
	
	//-----------------------------------------------------------------------------//
	// 정육,계란류 판매량 가져오기                                                 //
	//-----------------------------------------------------------------------------//
	public DashBoardDTO getMeat() throws DataAccessException;

	//-----------------------------------------------------------------------------//
	// 건강식품 판매량 가져오기                                                    //
	//-----------------------------------------------------------------------------//
	public DashBoardDTO getHealthy() throws DataAccessException;
	
	//-----------------------------------------------------------------------------//
	// 차·음료·생수·유제품 판매량 가져오기                                         //
	//-----------------------------------------------------------------------------//
	public DashBoardDTO getWater() throws DataAccessException;
	
	//-----------------------------------------------------------------------------//
	// 과자·간식·빵·빙과 판매량 가져오기                                           //
	//-----------------------------------------------------------------------------//
	public DashBoardDTO getSnack() throws DataAccessException;
	
}












